InformationRegisters/ДокументыРегламентныхОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ДокументыРегламентныхОпераций</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ТочкаМаршрута</Name>
					<Type>
						<v8:Type>cfg:BusinessProcessRoutePointRef.РасчетНДС</v8:Type>
						<v8:Type>cfg:BusinessProcessRoutePointRef.ЗакрытиеМесяца</v8:Type>
						<v8:Type>cfg:BusinessProcessRoutePointRef.ЗакрытиеМесяцаУСНДоходыМинусРасходы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДокументыРегламентныхОпераций/Ext/RecordSetModule.bsl
Процедура ЗаполнитьРегистрПоумолчанию() Экспорт

	ОбрабатываемыеБизнесПроцессы = Новый Массив();
	ОбрабатываемыеБизнесПроцессы.Добавить("ЗакрытиеМесяца");
	ОбрабатываемыеБизнесПроцессы.Добавить("РасчетНДС");
	ОбрабатываемыеБизнесПроцессы.Добавить("ЗакрытиеМесяцаУСНДоходыМинусРасходы");
	ТочкиМаршрутаБизнесПроцесса = БизнесПроцессЗакрытиеМесяца.ПолучитьТочкиМаршрутаЗакрытияМесяцаИРасчетаНДС(ОбрабатываемыеБизнесПроцессы);

	
	Макет = РегистрыСведений.ДокументыРегламентныхОпераций.ПолучитьМакет("СоставРегистраПоумолчанию");
	ОбластьСписок = Макет.Области.Найти("Список");
	
	Если ОбластьСписок <> Неопределено Тогда
		ОбластьСписок = Макет.ПолучитьОбласть("Список");
		Для Каждого ТочкаМаршрута ИЗ ТочкиМаршрутаБизнесПроцесса Цикл
			
			ОбластьТочкаМаршрута = ОбластьСписок.НайтиТекст(ТочкаМаршрута.Имя,,,Истина,Истина,,Истина);
			Если ОбластьТочкаМаршрута = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			ИмяОбласти = Лев(ОбластьТочкаМаршрута.Имя,СтрДлина(ОбластьТочкаМаршрута.Имя)-1) + "2";
			НовЗапись = Добавить();
			НовЗапись.ТочкаМаршрута = ТочкаМаршрута;
			НовЗапись.ТипДокумента = СокрЛП(ОбластьСписок.Область(ИмяОбласти).Текст);
		КонецЦикла;
	КонецЕсли; 

КонецПроцедуры //ЗаполнитьРегистрПоумолчанию

Процедура ПередЗаписью(Отказ, Замещение)
	
	 Для каждого Запись Из ЭтотОбъект Цикл
	 
	 	Если ПустаяСтрока(Запись.ТипДокумента) И Запись.ТипДокумента <> ""  Тогда
			Запись.ТипДокумента = "";
		КонецЕсли;
		
	 КонецЦикла; 
	
КонецПроцедуры
